app/views/reply_flags/_reply_flag.html.erb

<% reply_flag = Reply.find(reply_id) %>
<%= div_for(@reply, class: "flag") do %>
 <%= reply_flag.reply_flags.size %>
---
SELECT  "replies".* FROM "replies"  WHERE "replies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "reply_flags"  WHERE "reply_flags"."reply_id" = $1  [["reply_id", 1]]