app/views/like_counts/_new_thread.html.erb

<% new_thread = NewThread.find(new_thread_id) %>
<%= div_for new_thread do %>
&nbsp;&nbsp;<%= new_thread.like_counts.size %>
---
SELECT  "new_threads".* FROM "new_threads"  WHERE "new_threads"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "like_counts"  WHERE "like_counts"."new_thread_id" = $1  [["new_thread_id", 1]]