app/views/replies/_reply.html.erb

      <div class="pull-right">
        <div><i class="fa fa-clock-o"></i>replied <time itemprop="dateCreated" datetime=<%= reply.created_at %>><%= time_ago_in_words(reply.created_at) %></time> ago<br /></div>
---
INSERT INTO "replies" ("content", "created_at", "new_thread_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"