app/views/new_thread_flags/_new_thread_flag.html.erb

SELECT  "new_threads".* FROM "new_threads"  WHERE "new_threads"."id" = $1 LIMIT 1  [["id", 3]]
SELECT COUNT(*) FROM "new_thread_flags"  WHERE "new_thread_flags"."new_thread_id" = $1  [["new_thread_id", 1]]
---
<% new_thread = NewThread.find(new_thread_id) %>
<%= div_for(@new_thread, class: "flag") do %>
<%= new_thread.new_thread_flags.size %>