app/views/dislike_counts/_new_thread_dislike.html.erb

SELECT  "new_threads".* FROM "new_threads"  WHERE "new_threads"."id" = $1 LIMIT 1  [["id", 2]]
---
<% new_thread_dislike = NewThread.find(new_thread_id) %>

SELECT COUNT(*) FROM "dislike_counts"  WHERE "dislike_counts"."new_thread_id" = $1  [["new_thread_id", 1]]
---

<%= new_thread_dislike.dislike_counts.size %>