app/views/dislike_count_replies/_reply_dislike.html.erb

SELECT  "replies".* FROM "replies"  WHERE "replies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "dislike_count_replies"  WHERE "dislike_count_replies"."reply_id" = $1  [["reply_id", 1]]
---
<% reply_dislike = Reply.find(reply_id) %>
<%= div_for(@reply, class: "dislike-count") do %>
  <span itemprop="downvoteCount"><%= reply_dislike.dislike_count_replies.size %></span>