app/views/like_count_replies/_reply_like.html.erb

SELECT  "replies".* FROM "replies"  WHERE "replies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "like_count_replies"  WHERE "like_count_replies"."reply_id" = $1  [["reply_id", 1]]
---
<% reply_like = Reply.find(reply.id) %>
<%= div_for(reply, class: "like-count") do %>
  <span itemprop="upvoteCount"><%= reply_like.like_count_replies.size %></span>