app/views/new_threads/list.html.erb

        <td>
          <%= new_thread.replies.size %> &nbsp; Replies
---
SELECT COUNT(*) FROM "replies"  WHERE "replies"."new_thread_id" = $1  [["new_thread_id", 1]]