app/views/new_threads/show.html.erb

			<h2 class="thread-header">Replies:</h2>
				<% if @new_thread.replies.size == 0 %>
---
SELECT COUNT(*) FROM "replies"  WHERE "replies"."new_thread_id" = $1  [["new_thread_id", 2]]