app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"  WHERE "activities"."recipient_id" = 1 AND (owner_id not in (1))  ORDER BY created_at desc
---
 def index
 	sleep 0.7
    @activities = PublicActivity::Activity.order("created_at desc").where(recipient_id: current_user).where("owner_id not in (?)", current_user).all