app/controllers/dislike_count_replies_controller.rb

  def create
    @user = User.find(current_user.id)
    @reply = Reply.find(params[:reply_id])
    @dislike_count_reply = @user.add_reply_dislike(@reply.id)
    @reply_user = @reply.user
      respond_to do |format|
      if @dislike_count_reply.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "replies".* FROM "replies"  WHERE "replies"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "dislike_count_replies" ("created_at", "reply_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-05 11:06:08.626434"], ["reply_id", 1], ["updated_at", "2014-11-05 11:06:08.626434"], ["user_id", 1]]

    def set_dislike_count_reply
      @dislike_count_reply = DislikeCountReply.find(params[:id])
---
SELECT COUNT(*) FROM "dislike_count_replies"  WHERE "dislike_count_replies"."reply_id" = $1  [["reply_id", 1]]