app/controllers/dislike_counts_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "new_threads".* FROM "new_threads"  WHERE "new_threads"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "dislike_counts" ("created_at", "new_thread_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-31 05:13:27.559550"], ["new_thread_id", 2], ["updated_at", "2014-10-31 05:13:27.559550"], ["user_id", 1]]
---
  def create
    @user = User.find(current_user.id)
    @new_thread = NewThread.friendly.find(params[:new_thread_id])
    @dislike_count = @user.add_new_thread_dislike(@new_thread.id)
    @thread_user = @new_thread.user
    respond_to do |format|
      if @dislike_count.save