app/controllers/like_counts_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "new_threads".* FROM "new_threads"  WHERE "new_threads"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "like_counts" ("created_at", "new_thread_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-31 05:13:26.199194"], ["new_thread_id", 2], ["updated_at", "2014-10-31 05:13:26.199194"], ["user_id", 1]]
INSERT INTO "activities" ("created_at", "key", "owner_id", "owner_type", "parameters", "recipient_id", "recipient_type", "trackable_id", "trackable_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.find(current_user.id)
    @new_thread = NewThread.find(params[:new_thread_id])
    @like_count = @user.add_new_thread(@new_thread.id)
    @thread_user = @new_thread.user
      respond_to do |format|
      if @like_count.save
        @like_count.create_activity :create, owner: current_user, recipient: @new_thread.user