app/controllers/like_count_replies_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "replies".* FROM "replies"  WHERE "replies"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "like_count_replies" ("created_at", "reply_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-05 11:06:07.894941"], ["reply_id", 1], ["updated_at", "2014-11-05 11:06:07.894941"], ["user_id", 1]]
INSERT INTO "activities" ("created_at", "key", "owner_id", "owner_type", "parameters", "recipient_id", "recipient_type", "trackable_id", "trackable_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.find(current_user.id)
    @reply = Reply.find(params[:reply_id])
    @like_count_reply = @user.add_reply(@reply.id)
    @reply_user = @reply.user
    respond_to do |format|
      if @like_count_reply.save
        @like_count_reply.create_activity :create,
                                          owner: current_user,
                                          recipient: @reply.user

SELECT COUNT(*) FROM "like_count_replies"  WHERE "like_count_replies"."reply_id" = $1  [["reply_id", 1]]
---
  def set_like_count_reply
    @like_count_reply = LikeCountReply.find(params[:id])