app/controllers/new_threads_controller.rb

SELECT  "new_threads".* FROM "new_threads"   ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def list
    @new_threads = NewThread.paginate(:page => params[:page], :per_page => 10).order('id DESC')

SELECT  "new_threads".* FROM "new_threads"  WHERE (title @@ 'ruby on rails' or description @@ 'ruby on rails')  ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def search
    #@new_threads = NewThread.search ThinkingSphinx::Query.escape(params[:search])
    @new_threads = NewThread.text_search(params[:query]).paginate(:page => params[:page], :per_page => 10).order('id DESC')

SELECT  "new_threads".* FROM "new_threads"  WHERE "new_threads"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @new_thread = NewThread.friendly.find(params[:id])

INSERT INTO "new_threads" ("created_at", "description", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @new_thread = NewThread.new(new_thread_params)

    respond_to do |format|
      if @new_thread.save

SELECT  "new_threads".* FROM "new_threads"  WHERE "new_threads"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "new_threads" SET "title" = $1, "updated_at" = $2 WHERE "new_threads"."id" = 3  [["title", "gh j"], ["updated_at", "2014-10-31 07:06:15.492089"]]
---
  def update
    @new_thread = NewThread.friendly.find(params[:id])
    respond_to do |format|
      if @new_thread.update(new_thread_params)

SELECT  "new_threads".* FROM "new_threads"  WHERE "new_threads"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "new_threads" WHERE "new_threads"."id" = $1  [["id", 3]]
UPDATE "users" SET "points" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["points", 80], ["updated_at", "2014-10-31 07:06:38.520869"]]
---
  def destroy
    @new_thread = NewThread.friendly.find(params[:id])
    @thread_user = @new_thread.user
    @new_thread.destroy
    @thread_user.update_attributes(points: @thread_user.points-=20)