app/controllers/new_thread_flags_controller.rb

  def create
    @user = User.find(current_user.id)
    @new_thread = NewThread.friendly.find(params[:new_thread_id])
    @new_thread_flag = @user.add_new_thread_flag(@new_thread.id)
    respond_to do |format|
      if @new_thread_flag.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "new_threads".* FROM "new_threads"  WHERE "new_threads"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "new_thread_flags" ("created_at", "new_thread_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-31 05:13:33.104074"], ["new_thread_id", 3], ["updated_at", "2014-10-31 05:13:33.104074"], ["user_id", 1]]