app/controllers/reply_flags_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "replies".* FROM "replies"  WHERE "replies"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "reply_flags" ("created_at", "reply_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-03-05 16:37:07.078349"], ["reply_id", 1], ["updated_at", "2015-03-05 16:37:07.078349"], ["user_id", 1]]
---
  def create
    @user = User.find(current_user.id)
    @reply = Reply.find(params[:reply_id])
    @reply_flag = @user.add_reply_flag(@reply.id)
    respond_to do |format|
      if @reply_flag.save