app/controllers/replies_controller.rb

SELECT  "new_threads".* FROM "new_threads"  WHERE "new_threads"."id" = 1 LIMIT 1
INSERT INTO "replies" ("content", "created_at", "new_thread_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "points" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["points", -15], ["updated_at", "2015-02-28 18:56:45.600007"]]
INSERT INTO "activities" ("created_at", "key", "owner_id", "owner_type", "parameters", "recipient_id", "recipient_type", "trackable_id", "trackable_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @new_thread = NewThread.friendly.find(params[:new_thread_id])
    @reply = @new_thread.replies.create(reply_params)
    @user = @new_thread.user

    respond_to do |format|
      if @reply.save
        if current_user != @user
          @user.update_attributes(points: @user.points += 5)
          @badge = @user.update_badge(@user.id)
          @user.update_attributes(badge: @badge)
        end
        @reply.create_activity :create, owner: current_user, recipient: @new_thread.user

SELECT  "replies".* FROM "replies"  WHERE "replies"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "replies" SET "content" = $1, "updated_at" = $2 WHERE "replies"."id" = 3
---
  def update
    @reply = Reply.find(params[:id])
    authorize! :update, @reply
    # @new_thread = NewThread.find(:new_thread_id)
    respond_to do |format|
      if @reply.update(reply_params)

SELECT  "replies".* FROM "replies"  WHERE "replies"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "replies" WHERE "replies"."id" = $1  [["id", 3]]
UPDATE "users" SET "points" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["points", 0], ["updated_at", "2014-11-05 14:17:06.568211"]]
---
  def destroy
    @reply = Reply.find(params[:id])
    authorize! :destroy, @reply
    @reply_user = @reply.user
    if @reply.user.id = current_user.id
      Reply.find(params[:id]).destroy
      @reply_user.update_attributes(points: @reply_user.points -= 20)

SELECT  "new_threads".* FROM "new_threads"  WHERE "new_threads"."id" = 5 LIMIT 1
---
  def find_new_thread
    if params[:new_thread_id]
      @new_thread = NewThread.friendly.find_by_id(params[:new_thread_id])