app/controllers/sitemap_controller.rb

  def index
    headers['Content-Type'] = 'application/xml'
    last_new_thread = NewThread.last
    if stale?(:etag => last_new_thread, :last_modified => last_new_thread.updated_at.utc)
      respond_to do |format|
        format.xml { @new_threads = NewThread.all } # sitemap is a named scope
---
SELECT  "new_threads".* FROM "new_threads"   ORDER BY "new_threads"."id" DESC LIMIT 1
SELECT "new_threads".* FROM "new_threads"