app/views/users/registrations/edit.html.erb

        <% replies.each do |reply| %>
          <li><span class="count-cell" itemprop="upvoteCount"><%= reply.like_count_replies.size %></span>&nbsp;&nbsp;<%= link_to reply.new_thread.title, reply.new_thread , :itemprop=>"url"%><br><br></li>
---
SELECT "new_threads".* FROM "new_threads"  WHERE "new_threads"."user_id" = $1  [["user_id", 1]]
SELECT "replies".* FROM "replies"  WHERE "replies"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "like_count_replies"  WHERE "like_count_replies"."reply_id" = $1  [["reply_id", 1]]
SELECT COUNT(*) FROM "like_counts"  WHERE "like_counts"."new_thread_id" = $1  [["new_thread_id", 1]]